<a href="https://colab.research.google.com/github/Shtrohaim/WorkPIS_2/blob/main/%D1%80%D0%B0%D0%B1%D0%BE%D1%872.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# import package

In [21]:
import pandas as pd
import numpy as np
from IPython.display import display

# import data

In [22]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data",header=None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [23]:
names = ("Id","RI","Na","Mg","Al","Si","K","Ca","Ba","Fe","Class")
data.columns = names
data = data.drop(columns=["Id"])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [24]:
data['Class'].replace(
    {
       1:"building_float_processed",
       2:"building_non_float_processed",
       3:"vehicle_float_processed",
       4:"vehicle_non_float_processed",
       5:"containers",
       6:"tableware",
       7:"headlamps" 
    }, inplace=True)
data.head(7)

        RI     Na    Mg    Al  ...    Ca   Ba    Fe                     Class
0  1.52101  13.64  4.49  1.10  ...  8.75  0.0  0.00  building_float_processed
1  1.51761  13.89  3.60  1.36  ...  7.83  0.0  0.00  building_float_processed
2  1.51618  13.53  3.55  1.54  ...  7.78  0.0  0.00  building_float_processed
3  1.51766  13.21  3.69  1.29  ...  8.22  0.0  0.00  building_float_processed
4  1.51742  13.27  3.62  1.24  ...  8.07  0.0  0.00  building_float_processed
5  1.51596  12.79  3.61  1.62  ...  8.07  0.0  0.26  building_float_processed
6  1.51743  13.30  3.60  1.14  ...  8.17  0.0  0.00  building_float_processed

[7 rows x 10 columns]

# Добавить пропуски для последующей очистки

In [25]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index,col] = np.nan

# Визуализация данных

In [27]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      201 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      197 non-null    float64
 3   Al      203 non-null    float64
 4   Si      197 non-null    float64
 5   K       203 non-null    float64
 6   Ca      203 non-null    float64
 7   Ba      197 non-null    float64
 8   Fe      199 non-null    float64
 9   Class   201 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [28]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  201.000000  199.000000  197.000000  ...  203.000000  197.000000  199.000000
mean     1.518363   13.422010    2.634924  ...    8.976946    0.186599    0.055980
std      0.003077    0.831624    1.469855  ...    1.443960    0.514965    0.096053
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516510   12.930000    1.830000  ...    8.270000    0.000000    0.000000
50%      1.517680   13.330000    3.470000  ...    8.610000    0.000000    0.000000
75%      1.519180   13.850000    3.590000  ...    9.245000    0.000000    0.100000
max      1.533930   17.380000    4.490000  ...   16.190000    3.150000    0.510000

[8 rows x 9 columns]

In [29]:
display( data["Class"].describe())
print("===========================")
display( data["Class"].value_counts())

count                              201
unique                               6
top       building_non_float_processed
freq                                74
Name: Class, dtype: object

===========================

building_non_float_processed    74
building_float_processed        66
headlamps                       25
vehicle_float_processed         16
containers                      12
tableware                        8
Name: Class, dtype: int64